analogdevicesinc/msdk/Libraries/RF-PHY/MAX32665/include/dbb_tx.svd
<?xml version="1.0" encoding="UTF-8"?>
<device>
  <peripheral>
    <name>dbb_tx</name>
    <description>PAN2G TX Config</description>
    <baseAddress>TODO-base</baseAddress>
    <size>16</size>
    <registers>
      <register>
        <name>tx_info_version</name>
        <description>version</description>
        <addressOffset>0x0000</addressOffset>
        <size>32</size>
        <fields>
          <field>
            <name>minor</name>
            <description>Version minor part</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>major</name>
            <description>Version major part</description>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>tx_general_standard</name>
        <description>Standard: 1 = Zigbee (15.4), 2 = BAN (15.6),  3 = Bluetooth Low Energy (BTLE)</description>
        <addressOffset>0x0004</addressOffset>
        <size>16</size>
        <fields>
          <field>
            <name>standard</name>
            <description>Wireless standard to use.</description>
            <bitOffset>0</bitOffset>
            <bitWidth>2</bitWidth>
            <enumeratedValues>
              <enumeratedValue>
                <name>zigbee</name>
                <description>Zigbee (15.4).</description>
                <value>1</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>ban</name>
                <description>BAN (15.6).</description>
                <value>2</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>BTLE</name>
                <description>Bluetooth Low Energy (BTLE).</description>
                <value>3</value>
              </enumeratedValue>
            </enumeratedValues>
          </field>
        </fields>
      </register>
      <register>
        <name>tx_general_control</name>
        <description>control</description>
        <addressOffset>0x0006</addressOffset>
        <size>16</size>
        <fields>
          <field>
            <name>phy_enable</name>
            <description>Enable the PHY layer of the transmitter</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>dl_enable</name>
            <description>Enable the datalink layer of the tramsitter</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>encryption_enable</name>
            <description>Enable the link layer encryption.</description>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>tx_general_send_multi</name>
        <description>Enable the sending of a single frame multiple times. Without writing again the payload data neither the PHY header.</description>
        <addressOffset>0x0008</addressOffset>
        <size>32</size>
      </register>
      <register>
        <name>tx_phy_high_freq_coef</name>
        <description>Multiplier for DAC frequency output</description>
        <addressOffset>0x000c</addressOffset>
        <size>16</size>
      </register>
      <register>
        <name>tx_phy_low_freq_coef</name>
        <description>Multiplier for programmable divider frequency output</description>
        <addressOffset>0x000e</addressOffset>
        <size>16</size>
      </register>
      <register>
        <name>tx_phy_freq_carrier</name>
        <description>Carrier frequency</description>
        <addressOffset>0x0010</addressOffset>
        <size>32</size>
      </register>
      <register>
        <name>tx_phy_amp_coef</name>
        <description>Amplitude coefficient</description>
        <addressOffset>0x0014</addressOffset>
        <size>16</size>
      </register>
      <register>
        <name>tx_phy_filt</name>
        <description>filt</description>
        <addressOffset>0x0016</addressOffset>
        <size>16</size>
        <fields>
          <field>
            <name>skip_mux_sel</name>
            <description>Filter length selection. When bit x is 1, data is input after 3x taps, effectively bypassing them.</description>
            <bitOffset>0</bitOffset>
            <bitWidth>6</bitWidth>
          </field>
          <field>
            <name>scaling_factor</name>
            <description>Number of bits that filter output must be shifted right</description>
            <bitOffset>6</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <dim>16</dim>
        <dimIncrement>2</dimIncrement>
        <name>tx_phy_filt_coefs</name>
        <description>Filter coefficients</description>
        <addressOffset>0x0018</addressOffset>
        <size>16</size>
      </register>
      <register>
        <name>tx_phy_freq_offs</name>
        <description>freq_offs</description>
        <addressOffset>0x0038</addressOffset>
        <size>16</size>
        <fields>
          <field>
            <name>start</name>
            <description>Number of frequency samples to be skipped at start of output</description>
            <bitOffset>0</bitOffset>
            <bitWidth>5</bitWidth>
          </field>
          <field>
            <name>end</name>
            <description>Number of frequency samples to be skipped at end of output</description>
            <bitOffset>5</bitOffset>
            <bitWidth>5</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>tx_phy_ovrsamp_ratio</name>
        <description>Oversampling ratio</description>
        <addressOffset>0x003a</addressOffset>
        <size>16</size>
      </register>
      <register>
        <name>tx_phy_pattern_gen</name>
        <description>pattern_gen</description>
        <addressOffset>0x003c</addressOffset>
        <size>16</size>
        <fields>
          <field>
            <name>en</name>
            <description>Enable pattern generator</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>rst</name>
            <description>Reset pattern generator (needed after generator configuration change)</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>mode</name>
            <description>Pattern generation mode: 0 = PRBS, 1 = user pattern</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
            <enumeratedValues>
              <enumeratedValue>
                <name>prbs</name>
                <description>PRBS.</description>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>user</name>
                <description>user.</description>
                <value>1</value>
              </enumeratedValue>
            </enumeratedValues>
          </field>
          <field>
            <name>len</name>
            <description>Length of pattern in bits</description>
            <bitOffset>3</bitOffset>
            <bitWidth>5</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>tx_phy_pattern</name>
        <description>Mode 0: generator polynomial, mode 1: user pattern</description>
        <addressOffset>0x003e</addressOffset>
        <size>16</size>
      </register>
      <register>
        <name>tx_phy_const_output_enable</name>
        <description>const_output_enable</description>
        <addressOffset>0x0040</addressOffset>
        <size>16</size>
      </register>
      <register>
        <name>tx_phy_const_output_amp</name>
        <description>Constant value for amplitude output</description>
        <addressOffset>0x0042</addressOffset>
        <size>16</size>
      </register>
      <register>
        <name>tx_phy_const_output_freq_high</name>
        <description>Constant value for DAC frequency output</description>
        <addressOffset>0x0044</addressOffset>
        <size>32</size>
      </register>
      <register>
        <name>tx_phy_const_output_freq_low</name>
        <description>Constant value for programmable divider frequency output</description>
        <addressOffset>0x0048</addressOffset>
        <size>32</size>
      </register>
      <register>
        <name>tx_dbg_dl_lb</name>
        <description>The datalink Loop back is enabled. In this mode the datalink transmitter layer is connected to the datalink receiver layer (the transmitter and the receiver PHY layer are bypassed)</description>
        <addressOffset>0x004c</addressOffset>
        <size>32</size>
      </register>
      <register>
        <name>tx_dl_bypass</name>
        <description>Bypass the datalink layer. When this bit is set the frame (preamble data + header data + payload data) is sent directly to the PHY layer. </description>
        <addressOffset>0x0050</addressOffset>
        <size>16</size>
      </register>
      <register>
        <name>tx_dl_crc_mode</name>
        <description>crc_mode</description>
        <addressOffset>0x0052</addressOffset>
        <size>16</size>
        <fields>
          <field>
            <name>phr</name>
            <description>Header  CRC type: 0 = data bypassed, 1 = CRC-4, 2 = CRC-16, 3 = CRC-24</description>
            <bitOffset>0</bitOffset>
            <bitWidth>2</bitWidth>
            <enumeratedValues>
                <enumeratedValue>
                  <name>byp</name>
                  <description>data bypassed.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>crc4</name>
                  <description>CRC-4.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>crc16</name>
                  <description>CRC-16.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>crc24</name>
                  <description>CRC-24.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
          </field>
          <field>
            <name>pld</name>
            <description>Payload CRC type: 0 = data bypassed, 1 = CRC-4, 2= CRC-16, 3 = CRC-24</description>
            <bitOffset>2</bitOffset>
            <bitWidth>2</bitWidth>
            <enumeratedValues>
                <enumeratedValue>
                  <name>byp</name>
                  <description>data bypassed.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>crc4</name>
                  <description>CRC-4.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>crc16</name>
                  <description>CRC-16.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>crc24</name>
                  <description>CRC-24.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
          </field>
        </fields>
      </register>
      <register>
        <name>tx_dl_crc_init_phr</name>
        <description>CRC LFSR initialization value for the header</description>
        <addressOffset>0x0054</addressOffset>
        <size>32</size>
      </register>
      <register>
        <name>tx_dl_crc_init_pld</name>
        <description>CRC LFSR initialization value for the payload</description>
        <addressOffset>0x0058</addressOffset>
        <size>32</size>
      </register>
      <register>
        <name>tx_dl_bch</name>
        <description>bch</description>
        <addressOffset>0x005c</addressOffset>
        <size>16</size>
        <fields>
          <field>
            <name>phr_enable</name>
            <description>BCH encode enabled on the header</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>pld_enable</name>
            <description>BCH encode enabled on the payload</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>tx_dl_ban_settings</name>
        <description>ban_settings</description>
        <addressOffset>0x005e</addressOffset>
        <size>16</size>
        <fields>
          <field>
            <name>phr_scrmbl_sd</name>
            <description>Header scrambler seed, used to initialize the LFSR of the scrambler module when processing the header</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>phr_sprd_fact</name>
            <description>Header spread factor: 1 = sprd_fact_1, 2 = sprd_fact_2, 3 = sprd_fact_4, 4 = sprd_fact_8, 5 = sprd_fact_16</description>
            <bitOffset>1</bitOffset>
            <bitWidth>3</bitWidth>
            <enumeratedValues>
                <enumeratedValue>
                  <name>sprd_fact_1</name>
                  <description>sprd_fact_1.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sprd_fact_2</name>
                  <description>sprd_fact_2.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sprd_fact_4</name>
                  <description>sprd_fact_4.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sprd_fact_8</name>
                  <description>sprd_fact_8.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sprd_fact_16</name>
                  <description>sprd_fact_16.</description>
                  <value>5</value>
                </enumeratedValue>
              </enumeratedValues>
          </field>
          <field>
            <name>mdr_length</name>
            <description>MAC header length in bytes</description>
            <bitOffset>4</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>preamble_nbr</name>
            <description>The preamble number; this parameter is used in the 15.6 standard to choose between the 2 preamble data (please refer to the standard)</description>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>prop_pld_mod</name>
            <description>Proprietary mode payload modulation: OQPSK=0,  1 = DBPSK 2 = DQPSK, 3 = D8PSK, 4 = GMSK, 5 = GFSK </description>
            <bitOffset>9</bitOffset>
            <bitWidth>3</bitWidth>
            <enumeratedValues>
                <enumeratedValue>
                  <name>OQPSK</name>
                  <description>OQPSK.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DBPSK</name>
                  <description>DBPSK.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DQPSK</name>
                  <description>DQPSK.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D8PSK</name>
                  <description>D8PSK.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GMSK</name>
                  <description>GMSK.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GFSK</name>
                  <description>GFSK.</description>
                  <value>5</value>
                </enumeratedValue>
              </enumeratedValues>
          </field>
          <field>
            <name>prop_pld_sprd_fact</name>
            <description>Proprietary mode payload spread factor: 1 = sprd_fact_1, 2 = sprd_fact_2, 3 = sprd_fact_4, 4 = sprd_fact_8, 5 = sprd_fact_16</description>
            <bitOffset>12</bitOffset>
            <bitWidth>3</bitWidth>
            <enumeratedValues>
                <enumeratedValue>
                  <name>sprd_fact_1</name>
                  <description>sprd_fact_1.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sprd_fact_2</name>
                  <description>sprd_fact_2.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sprd_fact_4</name>
                  <description>sprd_fact_4.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sprd_fact_8</name>
                  <description>sprd_fact_8.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sprd_fact_16</name>
                  <description>sprd_fact_16.</description>
                  <value>5</value>
                </enumeratedValue>
              </enumeratedValues>
          </field>
        </fields>
      </register>
      <register>
        <name>tx_dl_btle_settings_adv_acc_addr</name>
        <description>Advertisement channel access address used to determine if frame is for advertisement channel</description>
        <addressOffset>0x0060</addressOffset>
        <size>32</size>
      </register>
      <register>
        <name>tx_dl_btle_settings_acc_addr</name>
        <description>Access addres that is transmitted</description>
        <addressOffset>0x0064</addressOffset>
        <size>32</size>
      </register>
      <register>
        <name>tx_dl_btle_settings_whit</name>
        <description>btle_settings_whit</description>
        <addressOffset>0x0068</addressOffset>
        <size>16</size>
        <fields>
          <field>
            <name>chan_nr</name>
            <description>Channel number used dewhitening</description>
            <bitOffset>0</bitOffset>
            <bitWidth>6</bitWidth>
          </field>
          <field>
            <name>bypass</name>
            <description>Whitening bypass enable</description>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>tx_dl_btle_longrange</name>
        <description>btle_longrange</description>
        <addressOffset>0x006a</addressOffset>
        <size>16</size>
        <fields>
          <field>
            <name>fecenc_en</name>
            <description>If '1' Fec encoding is enabled, if '0' Fec encoding is in bypass</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>fecenc_clr</name>
            <description>If '1' is written Fec encoder delay line will be set to '0'.</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>s_eq_8</name>
            <description>If set to '1' and Fec encoder is enabled; S=8, if set to '0' and Fec encoder is enabled =&gt; S=2</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
            <enumeratedValues>
              <enumeratedValue>
                <name>S8</name>
                <description>S8.</description>
                <value>1</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>S2</name>
                <description>S2.</description>
                <value>0</value>
              </enumeratedValue>
            </enumeratedValues>
          </field>
        </fields>
      </register>
      <register>
        <name>tx_dl_phr_modulation</name>
        <description>Header modulation: OQPSK=0,  1 = DBPSK 2 = DQPSK, 3 = D8PSK, 4 = GMSK, 5 = GFSK</description>
        <addressOffset>0x006c</addressOffset>
        <size>16</size>
        <fields>
          <field>
            <name>mod</name>
            <description>modulation.</description>
            <bitOffset>0</bitOffset>
            <bitWidth>3</bitWidth>
            <enumeratedValues>
              <enumeratedValue>
                <name>OQPSK</name>
                <description>OQPSK.</description>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>DBPSK</name>
                <description>DBPSK.</description>
                <value>1</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>DQPSK</name>
                <description>DQPSK.</description>
                <value>2</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>D8PSK</name>
                <description>D8PSK.</description>
                <value>3</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>GMSK</name>
                <description>GMSK.</description>
                <value>4</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>GFSK</name>
                <description>GFSK.</description>
                <value>5</value>
              </enumeratedValue>
            </enumeratedValues>
          </field>
        </fields>
      </register>
      <register>
        <name>tx_dl_phr</name>
        <description>Multi-standard PHY header (setting rate to 4 for the BAN standards results in the proprietary mode being used)</description>
        <addressOffset>0x006e</addressOffset>
        <size>16</size>
      </register>
      <register>
        <dim>66</dim>
        <dimIncrement>4</dimIncrement>
        <name>tx_pld_mem</name>
        <description>Payload memory: 66 address</description>
        <addressOffset>0x0070</addressOffset>
        <size>32</size>
      </register>
      <register>
        <name>tx_dl2_btle_speed_mode</name>
        <description>Set BTLE speed mode 0 = 1 Mb/s, 1 = 2 Mb/s</description>
        <addressOffset>0x0178</addressOffset>
        <size>16</size>
        <fields>
          <field>
            <name>speed</name>
            <description>speed.</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <enumeratedValues>
              <enumeratedValue>
                <name>1M</name>
                <description>1M.</description>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>2M</name>
                <description>2M.</description>
                <value>1</value>
              </enumeratedValue>
            </enumeratedValues>
          </field>
        </fields>
      </register>
    </registers>
  </peripheral>
</device>
